# Target guided odinal encoding

In [1]:
import pandas as pd
import numpy as np

In [33]:
df = pd.read_csv("C:/Users/korla/Desktop/github my account/Machine Learning/Naive baye's/titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [34]:
df.Cabin.head()

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: Cabin, dtype: object

In [35]:
df = df[['Cabin','Survived']]
df.head()

  Cabin  Survived
0   NaN         0
1   C85         1
2   NaN         1
3  C123         1
4   NaN         0

In [36]:
df.Cabin.fillna('missing',inplace=True)

In [37]:
df.head()

     Cabin  Survived
0  missing         0
1      C85         1
2  missing         1
3     C123         1
4  missing         0

In [38]:
df['Cabin'] = df['Cabin'].astype(str).str[0]

In [39]:
df.head()

  Cabin  Survived
0     m         0
1     C         1
2     m         1
3     C         1
4     m         0

In [40]:
df.Cabin.unique()

array(['m', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [43]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
T    0.000000
m    0.299854
Name: Survived, dtype: float64

In [44]:
a = df.groupby(['Cabin'])['Survived'].mean().sort_values().index
a

Index(['T', 'm', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [45]:
b = {k:i for i,k in enumerate(a,0)}
b

{'T': 0, 'm': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [46]:
df['Cabin_replaced'] = df['Cabin'].map(b)

In [47]:
df.head()

  Cabin  Survived  Cabin_replaced
0     m         0               1
1     C         1               4
2     m         1               1
3     C         1               4
4     m         0               1